Посчитайте среднее время жизни пользователей, которые выставили более 100 оценок. Под временем жизни понимается разница между максимальным и минимальным значением столбца timestamp для данного значения userId

In [26]:
import pandas as pd

ratings = pd.read_csv('ml-latest-small/ratings.csv')

ratings_grouped = ratings.groupby('userId').count()['rating'].reset_index()
ratings_filtered = ratings_grouped[ratings_grouped.rating >= 100]
film_fans_user_ids = ratings_filtered['userId'].tolist()
user_more100 = ratings[ratings['userId'].isin(film_fans_user_ids)]

#ищем время жизни
time_life = user_more100.pivot_table(index=['userId'], values=['timestamp'], aggfunc=[max,min]).reset_index()
time_life.head()

  userId         max         min
           timestamp   timestamp
0      4   949982274   949778714
1      5  1163375145  1163373044
2      8  1154474527  1154389340
3     15  1469330735   997937239
4     17  1127476640  1127468587

In [27]:
time_life['average'] = time_life['max'] - time_life['min']
time_life.head(10)

  userId         max         min    average
           timestamp   timestamp
0      4   949982274   949778714     203560
1      5  1163375145  1163373044       2101
2      8  1154474527  1154389340      85187
3     15  1469330735   997937239  471393496
4     17  1127476640  1127468587       8053
5     19   855195373   855190091       5282
6     21   854522908   853157476    1365432
7     22  1131753381  1131661890      91491
8     23  1166728253  1148386124   18342129
9     26  1371811577  1351544316   20267261



    Дана статистика услуг перевозок клиентов компании по типам (см. файл с кодом занятия). Необходимо сформировать две таблицы:

    таблицу с тремя типами выручки для каждого client_id без указания адреса клиента
    аналогичную таблицу по типам выручки с указанием адреса клиента
    Обратите внимание, что в процессе объединения таблиц данные не должны теряться.

In [28]:
rzd = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115],
        'rzd_revenue': [1093, 2810, 10283, 5774, 981]
    }
)
rzd

   client_id  rzd_revenue
0        111         1093
1        112         2810
2        113        10283
3        114         5774
4        115          981

In [29]:
auto = pd.DataFrame(
    {
        'client_id': [113, 114, 115, 116, 117],
        'auto_revenue': [57483, 83, 912, 4834, 98]
    }
)
auto

   client_id  auto_revenue
0        113         57483
1        114            83
2        115           912
3        116          4834
4        117            98

In [30]:
air = pd.DataFrame(
    {
        'client_id': [115, 116, 117, 118],
        'air_revenue': [81, 4, 13, 173]
    }
)
air

   client_id  air_revenue
0        115           81
1        116            4
2        117           13
3        118          173

In [31]:
client_base = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115, 116, 117, 118],
        'address': ['Комсомольская 4', 'Энтузиастов 8а', 'Левобережная 1а', 'Мира 14', 'ЗЖБИиДК 1', 
                    'Строителей 18', 'Панфиловская 33', 'Мастеркова 4']
    }
)
client_base

   client_id          address
0        111  Комсомольская 4
1        112   Энтузиастов 8а
2        113  Левобережная 1а
3        114          Мира 14
4        115        ЗЖБИиДК 1
5        116    Строителей 18
6        117  Панфиловская 33
7        118     Мастеркова 4

In [40]:
result = (client_base.filter(['client_id', 'address'], axis=1)
 .merge(air , how='left')
 .merge(auto , how='left')
 .merge(rzd , how='left'))

result.head(10)

   client_id          address  air_revenue  auto_revenue  rzd_revenue
0        111  Комсомольская 4          NaN           NaN       1093.0
1        112   Энтузиастов 8а          NaN           NaN       2810.0
2        113  Левобережная 1а          NaN       57483.0      10283.0
3        114          Мира 14          NaN          83.0       5774.0
4        115        ЗЖБИиДК 1         81.0         912.0        981.0
5        116    Строителей 18          4.0        4834.0          NaN
6        117  Панфиловская 33         13.0          98.0          NaN
7        118     Мастеркова 4        173.0           NaN          NaN